from collections import namedtuple

Part = namedtuple("Part", "name pages")
Chapter = namedtuple("Chapter", "name parts pages")
Book = namedtuple("Book", "name chapters parts pages")

shift_modifier=0

page_selector = 'think-ua - (.+)'
pdf_extension = '.pdf'
html_extension = '.html'

book_structure = Book('__name__',
    [
    Chapter('ПРО ЙОГУ ВОГНЮ',
        [
        Part('НОВИЙ СВІТ ПОЧИНАЄТЬСЯ З ДІТЕЙ, ЩО НАПОВНЕНІ РАДІСТЮ',
        '17-35'),
        Part('СЕРЦЕ ДІВЧИНКИ ВПІЗНАЛО!',
        '36-37'),
        Part('СЛУЖИТЕЛЬ КРАСИ',
        '38-39'),
        Part('«...ВИ МОЖЕТЕ РОБИТИ ВЛАСНІ ВИСНОВКИ»',
        '40-42'),
        Part('ПРО ЙОГУ ВОГНЮ',
        '13-16'),
        ],
        '11-12'
    ),
    Chapter('ВІСНИКИ СВІТЛА',
        [
        Part('ПЛАНЕТА КВІТКА',
        '45-52'),
        Part('ПОКЛИК ГІР',
        '53-64'),
        Part('ПОСПІШАЮЧИЙ',
        '65-76'),
        Part('МОЛИТВА',
        '89-90'),
        Part('ТРУД + ЛЮБОВ = КРАСА',
        '91-97'),
        Part('ВЧИТЕЛЬ НІКОЛИ НЕ СКАЖЕ: «НАДАЙ УВАГУ МЕНІ»',
        '98-104'),
        Part('СПОКУСА',
        '105-111'),
        Part('ЯКЩО ЩЕ НЕМАЄ ПРАГНЕННЯ',
        '112-117'),
        Part('ДВІЙКА ЗА МРІЮ',
        '118-126'),
        Part('«ДРУЖЕ, НЕ ВЛАШТОВУЙ ЗЕМЛЕТРУСУ»',
        '127-140'),
        Part('ПОДОЛАННЯ СЕБЕ',
        '141-145'),
        Part('НЕПОМІЧЕНЕ ВИПРОБУВАННЯ',
        '146-158'),
        Part('САДІВНИК',
        '159-175'),
        Part('ПРОБУДЖЕННЯ СЕРЦЯ',
        '176-191'),
        Part('СЕРЦЕ НЕ ОБМАНЕШ',
        '192-201'),
        Part('ЯКИМ ГОЛОСОМ ГОВОРИТЬ ВЧИТЕЛЬ',
        '202-209'),
        Part('ПРОСВІТЛЕННЯ',
        '210-219'),
        Part('ПРО ГРУДКУ ГРЯЗЮКИ, КИНУТУ У ВЧИТЕЛЯ',
        '220-224'),
        Part('ПРО ДВІ ЗУСТРІЧІ З ВЧИТЕЛЕМ',
        '225-230'),
        Part('ЗАХИСТИ!',
        '231-244'),
        Part('НЕГОТОВИЙ',
        '245-255'),
        Part('КРИХТИ ЛЮБОВІ',
        '256-258'),
        Part('КОЛИ І РОЗУМУ НЕМА, І НАВІТЬ ОЧІ НЕРОЗУМНІ',
        '314-323'),
        Part('ПІСНЯ В ДОПОМОГУ',
        '324-331'),
        Part('НЕ БУВАЄ НЕПРАВДИВИХ ЛЕГЕНД, АБО ПРО ТАЄМНИЦЮ ПІДЗЕМЕЛЬ АСГАРТИ',
        '77-88'),
        Part('ШЛЯХ, НА ЯКОМУ ЛЮДИ НЕ РОЗРІЗНЯЮТЬСЯ ЗА ВІКОМ',
        '259-270'),
        Part('НЕ СТОЯТИ ГРАДУ БЕЗ ПРАВЕДНИКА',
        '271-303'),
        Part('У ПОШУКАХ ВЧИТЕЛЯ',
        '304-313'),
        Part('ПОДВИГ',
        '332-352'),
        ],
        '43-44'
    ),
    ],
    [
    ],
    '1-10')
pages_dictionary = {
    271: 'Страница 271 Частина перша. СПІВЧУТТЯ',
    288: 'Страница 288 Частина друга. І БУВ ДЕНЬ, І БУЛА НІЧ',
}