# coding=utf-8

from collections import namedtuple

default_book_name = "____current_book"
# default_book_name = "Тест"
# default_book_name = "I. Космогенезис (космическая эволюция)"
Part = namedtuple("Part", "name pages num")
Part.__new__.__defaults__ = (None, None, None)
Chapter = namedtuple("Chapter", "name parts pages")
Book = namedtuple("Book", "name chapters parts pages")

page_selector = 'think-bg - (.+)'
pdf_extension = '.pdf'
html_extension = '.html'
#book_number = '1431'
#book_number = '1230'
#book_number = '1220'
book_number = '9002'

#file_name_prefix = "ЛД 'ТД ЕПБ' том 3 "
#file_name_postfix = ".pdf"


#files_path = 'c:\\5\\Архив\\'
files_path = '/users/schrecknetuser/pdf-ocr/think-bg/think-bg.pdf/'

shift_modifier=-1

book_structure = Book('__name__',
    [
    Chapter('ЗА ОГНЕНАТА ЙОГА',
        [
        ],
        '9-31'
    ),
    Chapter('ВЕСТИТЕЛИ НА СВЕТЛИНАТА',
        [
        ],
        '32-248'
    ),
    ],
    [
    ],
    '1-8')
pages_dictionary = {
    11: 'Страница 11. НОВИЯТ СВЯТ ЩЕ ЗАПОЧНЕ ОТ ИЗПЪЛНИЛИТЕ СЕ С РАДОСТ ДЕЦА. ХИМНЪТ НА СВЕТЛИНАТА, КОЙТО БЛАГОДАРЕНИЕ НА ПРАТЕНИК ОТ ДАЛЕЧЕН СВЯТ – ВЕСТИТЕЛ НА СВЕТЛИНАТА, – ЗАПЕЛИ ЗЕМНИТЕ ДЕЦА.',
    12: 'Страница 12. НЯМА НИТО ЕДНА ЛЪЖЛИВА ЛЕГЕНДА!',
    13: 'Страница 13. КОЙ Е РАЗКАЗАЛ ЛЕГЕНДАТА, КОЯТО ПРОЧЕТОХМЕ? И КОЙ Я Е ПРЕДАЛ НА ХОРАТА?',
    18: 'Страница 18. КАК Е ВЪЗМОЖНО ДА СЕ СЛУЧИ ВСИЧКО ТОВА?!',
    26: 'Страница 26. СЪРЦЕТО НА МОМИЧЕНЦЕТО ГО ПОЗНА.',
    28: 'Страница 28. СЛУЖИТЕЛ НА КРАСОТАТА.',
    30: 'Страница 30. „...ВИЕ САМ МОЖЕТЕ ДА СИ НАПРАВИТЕ ИЗВОДИТЕ”.',
    35: 'Страница 35. ПЛАНЕТАТА ЦВЕТЕ.',
    41: 'Страница 41. ЗОВЪТ НА ПЛАНИНИТЕ.',
    49: 'Страница 49. БЪРЗАЩИЯТ.',
    57: 'Страница 57. ИЛИ ЗА ТАЙНСТВЕНИТЕ ПОДЗЕМИЯ НА АСГАРТА.',
    66: 'Страница 66. МОЛИТВАТА.',
    68: 'Страница 68. ТРУД + ЛЮБОВ = КРАСОТА.',
    73: 'Страница 73. УЧИТЕЛЯТ НИКОГА НЯМА ДА КАЖЕ: “ОКАЖИ МИ ВНИМАНИЕ” ”.',
    81: 'Страница 81. ИЗКУШЕНИЕТО.',
    86: 'Страница 86. АКО ВСЕ ОЩЕ НЯМА УСТРЕМ.',
    91: 'Страница 91. ДВОЙКА ЗА МЕЧТАТА.',
    97: 'Страница 97. “ПРИЯТЕЛЮ, НЕ ПОРАЖДАЙ ЗЕМЕТРЕСЕНИЯ”.',
    106: 'Страница 106. ПРЕОДОЛЯВАНЕ НА СЕБЕ СИ!',
    110: 'Страница 110. НЕЗАБЕЛЯЗАНОТО ИЗПИТАНИЕ.',
    120: 'Страница 120. ГРАДИНАРЯТ.',
    129: 'Страница 129. ПРОБУЖДАНЕТО НА СЪРЦЕТО.',
    140: 'Страница 140. СЪРЦЕТО НЕ МОЖЕШ ДА ИЗЛЪЖЕШ.',
    146: 'Страница 146. С КАКЪВ ГЛАС ГОВОРИ НЕЗРИМИЯТ УЧИТЕЛ.',
    152: 'Страница 152. ПРОСВЕТЛЕНИЕТО.',
    160: 'Страница 160. ЗА БУЦАТА КАЛ, ХВЪРЛЕНА СРЕЩУ УЧИТЕЛЯ.',
    164: 'Страница 164. ЗА ДВЕ СРЕЩИ С УЧИТЕЛЯ.',
    169: 'Страница 169. ЗАЩИТИ!',
    178: 'Страница 178. НЕГОТОВИЯТ.',
    186: 'Страница 186. ТРОХИТЕ НА ЛЮБОВТА.',
    189: 'Страница 189. ПЪТЯТ, НА КОЙТО ХОРАТА НЕ СЕ РАЗЛИЧАВАТ ПО ВЪЗРАСТ.',
    197: 'Страница 197. НЕ ЩЕ УСТОИ ГРАДЪТ БЕЗ ПРАВЕДНИК. Първа част СЪСТРАДАНИЕТО.',
    208: 'Страница 208. Част втора И БЕШЕ ДЕН, И БЕШЕ НОЩ…',
    217: 'Страница 217. В ТЪРСЕНЕ НА УЧИТЕЛЯ.',
    223: 'Страница 223. КОГАТО И УМ НЯМА, И ОЧИТЕ ДОРИ ОГЛУПЯВАТ.',
    230: 'Страница 230. ПЕСЕНТА ИДВА НА ПОМОЩ.',
    236: 'Страница 236. ПОДВИГ.',
}